tutorials/reactiveTransport/reactiveTransportDBSFoam/3DcalcitePost/0_org/eps
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      eps;
}

dimensions      [0 0 0 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    frontAndBack
    {
        type zeroGradient;
    }
    left
    {
        type zeroGradient;
    }
    right
    {
        type zeroGradient;
    }
    top
    {
        type zeroGradient;
    }
    bottom
    {
        type zeroGradient;
    }
}
